//1. Напишіть програму, яка перевіряє, чи число є додатним, від'ємним чи нулем. Виведіть відповідне повідомлення для кожного випадку.

// let x = +prompt('чи є число додатнім');
//     if (x > 0){
//         alert('positive');
//     } else if(x === 0){
//         alert(0)
//     }else if (x < 0){
//         alert(' negative');
//     }

// 2. Напишіть програму, яка перевіряє, чи число є парним. Виведіть повідомлення "Парне" або "Непарне" в залежності від результату.
// let x = +prompt('writte number');
//     if (x % 2 == 0 ){
//         alert( 'парне' );
//     } else if(x == 0){
//         alert(0)
//     }else if (x > 0){
//         alert( 'непарне' );
//     }
// 3. Напишіть програму, яка порівнює два числа і виводить повідомлення про те, яке з них більше або чи вони рівні.
// let x = +prompt( 'writte first number' );
// let y = +prompt( 'writte second number' );
// if (x > y){
//     alert( 'more than' );
// } else if (x > y){
//     alert (0)
// }else if (x < y){
//     alert('few than')
// }

// 4. Напишіть програму, яка перевіряє, чи є введене число кратним 5. Виведіть повідомлення "Кратне 5" або "Не кратне 5" в залежності від результату.
// let x = +prompt('writte number');
//     if ( x % 5 ==0 ){
//         alert( 'number is a multiple of 5' );
//     } else {
//         alert('number  not a multiple of 5' );
//     }
// 5. Напишіть програму, яка перевіряє, чи введене число є дільником 10. Виведіть повідомлення "Дільник 10" або "Не дільник 10" в залежності від результату.
// let x = +prompt('введіть число');
//     if ( x % 10 == 0 ){
//         alert('Дільник 10');
//     } else {
//         alert('Не дільник 10');
//     }
// 6. Напишіть програму, яка перевіряє, чи є введене число додатним та парним одночасно. Виведіть відповідне повідомлення.
// let x = +prompt('введіть число');
//     if ( x % 2 ===0 ){
//         alert ('число додатнє, парне');
//     } else {
//         alert ('число недодатнє, непарне');
//     }
// 7. Напишіть програму, яка перевіряє, чи введене число є кратним 3 і 5 одночасно. Виведіть відповідне повідомлення.
// let x = +prompt('введіть число');
//     if ( x % 3 % 5 == 0 ){
//         alert('число кратне 3 і 5');
//         } else {
//             alert ('число некратене 3 і 5');
//         }
// 8.* Розробіть програму, яка перевіряє, чи є рік, введений користувачем, високосним. Виведіть повідомлення "Рік є високосним" або "Рік не є високосним".
// let year = prompt('please writter year');
// if ( year % 4 == 0 & year % 100 != 0 ){
//     alert('Високосний рік');
// } else { ( year % 4 == 0 & year % 400 != 0 );
//     alert ('невисокосний рік');
// }

// 9. Зробити всі завдання, які є на сторінці 

// 1.Чи буде показано alert?
// if ("0") {
//     alert(' Hello');
// }

// 2.Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’
// 'use strict';
// let value = prompt('Which official name JavaScript?','');

// if (value == 'ECMAScript'){
//     alert ('right');
// } else{
//     alert('You dont know ECMAScript')
// }

// 3.Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:
// 1, якщо значення більше нуля,
// -1, якщо меньше нуля,
// 0, якщо дорівнює нулю.
// let value = prompt(' writte number')
// if (value > 0){
//     alert( 1 );
// } else if (value < 0 ) {
//     alert( -1);
// } else {
//     alert( 0 );
// }

// 4.Перепишіть конструкцію if, використовуючи умовний оператор '?'
// let result = (a + b < 4) ? 'lowest' : 'highest';

// 5.Перепишіть if..else, використовуючи декілька тернарних операторів '?'.
// Для зручності читання рекомендується розділити код на кілька рядків.
// let message = (login == 'worker') ? 'Hi':
// (login == 'Boss') ? 'Congratulation' :
// (login == '')? 'Dont have login' :
// '';